app/controllers/books_controller.rb

  def create
    @book = current_user.books.build(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("title", "picture", "author", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Orlando"], ["picture", ""], ["author", "Virginia Woolf"], ["description", "descirption 1"], ["created_at", "2016-04-17 18:13:25.849816"], ["updated_at", "2016-04-17 18:13:25.849816"]]